WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDateTime_Client_Request-5.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDateTime</a:Action>
    <a:MessageID>urn:uuid:597a18f9-c9e9-44a8-875d-0a2992b20727</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDateTime xmlns="http://tempuri.org/">
      <inDateTime>2005-06-30T12:00:00-07:00</inDateTime>
    </RetDateTime>
  </s:Body>
</s:Envelope>